cache/posts/Cloud Storage.html
<br>
<br>

<p>
In the cloud environment, when deploying an application through a
kubernetes cluster a question that naturally arise is how to save
data and general information. 
</p>

<p>
What you actually want to achieve is to mount a file system on your
containers and read it as it was local.
</p>

<p>
This posts tries to make the point for the general approached used to
tackle the issue.
</p>

<!-- TEASER_END -->

<div id="outline-container-org1f42559" class="outline-2">
<h2 id="org1f42559">Storage possibilities</h2>
<div class="outline-text-2" id="text-org1f42559">
<p>
Without entering into the details of the different storage
possibilities it is important to understand the differences among
different storage options.
</p>

<p>
In this sense we distinguish among:
</p>

<ol class="org-ol">
<li><i>dynamic &amp; static</i> storage or as usually called in the kubernetes infrastructure <i>persistent volume</i><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.</li>

<li><b>Storage access mode</b>: 
<ul class="org-ul">
<li><i>RWO</i>: read and write once</li>

<li><i>ROX</i>: read only many</li>

<li><i>RWX</i>: read write many.</li>
</ul></li>

<li><b>Data Retention Models</b>:
<ul class="org-ul">
<li>Retain</li>

<li>Delete</li>

<li>Recycle</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgbaa38f8" class="outline-2">
<h2 id="orgbaa38f8">Storage lifecycle</h2>
<div class="outline-text-2" id="text-orgbaa38f8">
<p>
Given the above possibilities a brief outline of the typical <i>workload
block storage</i> will be exposed.
</p>

<p>
Before starting it is though important to understand that what your
application is trying to achieve is to connect to some storage and to
consume this within the application. Kubernetes supports multiple
storage classes. The access to such file systems is usually defined
within a <i>YAML</i> file where the IP, user, and psswd together with all
of the other necessary information are stored. Given such <i>YAML</i> file
it is then possible to consume that storage. Notice, that if you do
not provide such <i>YAML</i> file the container will chose the default
storage class, and if no default is specified it will simply use the
first one it finds that meets your requirements.
</p>

<p>
Given this basic outline, everything starts from a PVC, i.e. a
persistent volume claim, within the application deployment. Here your
application basically requires access to a persistent volume and
claims that it wants to utilize that for reading or writing of
data. Here the <i>storage access mode</i> mentioned above comes into play.
</p>

<p>
If the PVC is <i>RWO</i> then the application request unique write to read
and write to the persistent volume, no other application container can
access the persistent storage in this case and access the file
system. In contrast to that <i>ROX</i> allows the possibility for many
containers to mount the persistent volume and read it but restricts
the possibility to write to it. Finally <i>RWX</i> offers the possibility
to mount the storage and consume it both by reading and mounting it.
</p>

<p>
Given that the only other important point to be made is on the
retention mode described above. If the storage class is on <i>Retain</i>
mode, then the PV never goes away. That is if I write some data to the
PV and I delete my application, the written data will as well as the
modified PV will stay around. This case might be useful for data that
you are requested to keep on your systems. You can then write a second
program that goes over your PV, backs up the data and deletes the PV.
In contrast to that in <i>Delete</i> mode your application request a PV (a
dynamic one) and once you are over with your application and delete
it, you automatically delete your PV.  The final option is <i>Recycle</i>
this is tricky cause in the recycle mode the PV will stay around but a
<code>rm -rf /</code> is executed and therefore the PV will be empty. Do not use
it therefore for sensible data you want to keep.
</p>

<p>
A final note is given to PV mode. When it is <i>static</i> it means that
the PV must have been manually created <b>ex-ante</b> application
deployment and must be manually deleted or recycled. In contrast to
that a <i>dynamic</i> PV will be generated within the application through
the PVC.
</p>
</div>
</div>

<div id="outline-container-org7974326" class="outline-2">
<h2 id="org7974326">Literature</h2>
<div class="outline-text-2" id="text-org7974326">
<p>
IBM - Journey to Cloud Series.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
notice that the name is confusing. Persistent does not mean
that the information will be stored for long term purposes in a
<i>persistent</i> way. Whether this is or not the case depends rather on
the combination of the PV possibilities mentioned above.
</p></div></div>


</div>
</div>
